In [1]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [8]:
df = pd.DataFrame(randn(5,5),['A','B','C','D','E'],['W','X','Y','Z','O'])

In [9]:
df

          W         X         Y         Z         O
A -0.525171  0.592660  0.642472 -0.363860  1.136775
B -0.576258 -0.955128 -1.459345 -3.007760 -0.912934
C  0.548992  0.396047 -2.181114  0.282905  0.764415
D -0.237702  0.165331 -0.407353 -2.287743  0.268254
E -0.973736  0.093518  0.491845  0.446701 -0.292702

In [12]:
df > 0

       W      X      Y      Z      O
A  False   True   True  False   True
B  False  False  False  False  False
C   True   True  False   True   True
D  False   True  False  False   True
E  False   True   True   True  False

In [13]:
booldf = df > 0

In [15]:
df[booldf]

          W         X         Y         Z         O
A       NaN  0.592660  0.642472       NaN  1.136775
B       NaN       NaN       NaN       NaN       NaN
C  0.548992  0.396047       NaN  0.282905  0.764415
D       NaN  0.165331       NaN       NaN  0.268254
E       NaN  0.093518  0.491845  0.446701       NaN

In [16]:
df[df>0]

          W         X         Y         Z         O
A       NaN  0.592660  0.642472       NaN  1.136775
B       NaN       NaN       NaN       NaN       NaN
C  0.548992  0.396047       NaN  0.282905  0.764415
D       NaN  0.165331       NaN       NaN  0.268254
E       NaN  0.093518  0.491845  0.446701       NaN

In [18]:
df['W']>0

A    False
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [20]:
df[df['W']>0]

          W         X         Y         Z         O
C  0.548992  0.396047 -2.181114  0.282905  0.764415

In [21]:
df[df['X']>0]

          W         X         Y         Z         O
A -0.525171  0.592660  0.642472 -0.363860  1.136775
C  0.548992  0.396047 -2.181114  0.282905  0.764415
D -0.237702  0.165331 -0.407353 -2.287743  0.268254
E -0.973736  0.093518  0.491845  0.446701 -0.292702

In [22]:
df[df['O']<0]                  # This code is for => if shows the all values where 'O' is less than zero

          W         X         Y         Z         O
B -0.576258 -0.955128 -1.459345 -3.007760 -0.912934
E -0.973736  0.093518  0.491845  0.446701 -0.292702

In [23]:
df[df['W']>0]      # This code shows the values where 'W' is greater than zero(o)

          W         X         Y         Z         O
C  0.548992  0.396047 -2.181114  0.282905  0.764415

In [35]:
boolser = df['W']>0
result = df[boolser]

In [34]:
result

          W         X         Y         Z         O
C  0.548992  0.396047 -2.181114  0.282905  0.764415

In [37]:
myVariable = df['W'] > 0
result = df[myVariable]
mycols = ['X','Y']
result[mycols]

          X         Y
C  0.396047 -2.181114

In [41]:
result[mycols]

          X         Y
C  0.396047 -2.181114

In [48]:
df[(df['W']>0) & (df['O'] > 0)]         # We cannot use 'and' operator , just use the & for and operation

          W         X         Y         Z         O
C  0.548992  0.396047 -2.181114  0.282905  0.764415

In [49]:
df[(df['W']>0) | (df['O'] > 1)]

          W         X         Y         Z         O
A -0.525171  0.592660  0.642472 -0.363860  1.136775
C  0.548992  0.396047 -2.181114  0.282905  0.764415